# Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

n = int(input('Введите натуральное трехзначное число: '))
num = n
sum = 0
while n != 0:
    sum, n = sum + n % 10, n // 10
print(f'{num} -> {sum} ({(num // 100) % 10} + {(num // 10) % 10} + {num % 10})')