# Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

num = int(input('Введите натуральное трехзначное число: '))
n = str(num)
if len(n) == 3:
  sum = int(n[0]) + int(n[1]) + int(n[2])
  print(f'{num} -> {sum} ({int(n[0])} + {int(n[1])} + {int(n[2])})')
else:
  print('Введено неправильное число')